Repository: 84000/data-translation-memory
Catalog: toh136-v3.tmx
Source language: bo
Languages: en

source: ཐ་ན་ལྷག་པའི་བསམ་པས་སེམས་སྐྱེད་པ་གཅིག་ཙམ་སྐྱེད་པར་བྱེད་ན་དེ་དང་ལྡན་པའི་རྒྱུད་ཀྱིས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་པོ་ཡོངས་སུ་འཛིན་པར་འགྱུར་ཞིང་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་དང་གྲངས་མེད་པ་རབ་ཏུ་འཕེལ་བར་འགྱུར་རོ། །
en: If they can develop this for a single instant, the very moment such a mind is generated they will attain great stores of merit, and these will then greatly increase to become boundless and innumerable stores of merit.

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་སངས་རྒྱས་ཁྲག་ཁྲིག་ཕྲག་བཅྭ་བརྒྱད་མངོན་སུམ་དུ་གྱུར་པ་ལ་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བཅྭ་བརྒྱད་དུ་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པ་བྱས།
en: “Ānanda, even for noble sons and daughters who have directly served, respected, honored, venerated, and supplicated eighty billion buddhas with all kinds of pleasing articles for eighteen billion years, if they have not generated the mind set on awakening and have not made this aspiration, they will not gain as much merit as those aforementioned noble sons, nor will their stores of merit increase in the same way.

source: རྗེད་པ་བྱས། གསོལ་བ་བྱས་ཀྱང་དེ་སེམས་བསྐྱེད་པ་དང་། སྨོན་ལམ་འདི་དང་བྲལ་བར་གྱུར་ན། དེས་ནི་རིགས་ཀྱི་བུ་སྔ་མ་དེས་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་ཙམ་ཡོངས་སུ་བཟུང་བར་འགྱུར་བ་དེ་ཙམ་དུ་བསོད་ནམས་ཀྱི་ཕུང་པོ་རབ་ཏུ་འཕེལ་བར་མི་འགྱུར་རོ། །ཀུན་དགའ་བོ་ཁྱེའུ་འདིས་ངའི་བསྟན་པ་འདི་ལ་ཉིན་མཚན་འདིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་པར་འགྱུར་བ་ལྟར་ནི་ངའི་ཉན་ཐོས་ཤཱ་རིའི་བུ་དང་།
en: “Ānanda, with this teaching of mine, this child will benefit beings day and night in ways that Śāriputra, Maudgalyāyana, and my other disciples have not benefited beings with this teaching of mine.

source: མཽད་གལ་གྱི་བུ་དང་། གཞན་དག་གིས་ཀྱང་ངའི་གསུང་རབ་འདི་ལ་སེམས་ཅན་རྣམས་ཀྱི་དོན་མ་བྱས་སོ། །ཀུན་དགའ་བོ་གལ་ཏེ་ཁྱེད་ཅག་གིས་ཚེའི་ཚད་བསྐལ་པར་གནས་པར་གྱུར་ལ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པར་བྱེད་ཅིང་ཉིན་མཚན་དུ་ཡིད་ལ་བྱེད་པ་གཞན་མེད་པར་ཆོས་སྟོན་པར་གྱུར་ཏེ། དེ་ལྟར་བྱས་ཀྱང་ཁྱེད་ཅག་གིས་ནི་ཁྱེའུ་འདིས་བསྟན་པ་འདིའི་ཁུར་ཇི་ཙམ་ཐོགས་པའམ། ཐོགས་པར་འགྱུར་བ་དེ་ཙམ་གྱི་ཁུར་ཐོགས་པར་མི་ནུས་སོ། །
en: Ānanda, even if you were to live for an eon, doing nothing other than teaching the Dharma day and night to beings with total commitment, even if you were to do that, you would not be able to convey this teaching as much as this child does, nor convey it as well.

source: ཀུན་དགའ་བོ་དེ་ལྟར་ན་གང་དག་སེམས་ཅན་རྣམས་ལ་ཕན་པའི་དངོས་པོ་དང་།
en: “So Ānanda, this is a child of limitless good qualities.

source: སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བ་དང་། སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པ་དང་།
en: He really benefits beings, he loves beings, he is of great help to beings, and he regards beings with equanimity.

source: སེམས་ཅན་རྣམས་ལ་འདུ་ཤེས་བཏང་སྙོམས་སུ་བྱེད་པ་དག་ནི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་ཡིན་པས་ཁྱེའུ་འདི་ཡང་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་ཡིན་ཏེ། ཁྱེའུ་འདི་ནི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: His limitless good qualities are inconceivable.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ལྷོ་ཕྱོགས་ནས་སྟོན་ཀའི་དུས་ཀྱི་ཚེའི་ཉི་མ་འཆར་བ་འདྲ་ཞིང་ཟླ་བ་ཉ་བའི་ཟླ་བའི་དཀྱིལ་འཁོར་ཤིན་ཏུ་རྒྱས་པ་འཆར་བ་འདྲ་བའི་ཁྱེའུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ལས་བྱས་པའི་དབྱིག་པས་ས་ཆེན་པོ་འདི་ལ་རྡེབས་པར་བྱེད་ཅིང་འོང་བ་མཐོང་ངམ། དེས་ས་ཆེན་པོ་ལ་རྡེབས་པ་ན་འདི་ལྟ་བུའི་སྒྲ་འབྱུང་སྟེ།
en: “Ānanda, did you see the child arriving from the south, like the sun rising in autumn, like the immense disk of the full moon rising, striking his staff made of various precious substances upon the great earth?

source: འདི་ལྟ་སྟེ་དཔེར་ན་ཡུལ་མ་ག་དྷཱ་ནས་བྱུང་བའི་སྣོད་རིན་པོ་ཆེ་ལས་བྱས་པའམ། གསེར་ལས་བྱས་པའམ། དངུལ་ལས་བྱས་པ། ཤིན་ཏུ་མཐར་ཕྱིན་པར་བྱས་པ། བྱི་དོར་ལེགས་པར་བྱས་པ། ཤིན་ཏུ་ཕྱིས་པ། དྲི་མ་མེད་པ། བུག་རྡོལ་མེད་པ། ནག་ནོག་མེད་པ། དྲི་མ་བཀྲུས་པ། རྡུལ་མེད་པ། སྣུམ་བག་མེད་པ།
en: As it strikes the earth his staff makes such a sound as if it were made from precious Magadhan materials, or from gold or silver.

source: ཡོ་བྱད་རྣམ་པ་མང་པོའི་ཡོ་བྱད་དུ་བྱས་པ། ཤིན་ཏུ་བྱང་བའི་ཡོན་ཏན་དང་ལྡན་པ། གནས་ལྔ་རབ་ཏུ་རྫོགས་པ། གནས་བཅུ་ཡོངས་སུ་སྤངས་པ། ཉེ་བའི་སྐྱོན་བཅུ་གཉིས་དང་བྲལ་བ།
en: It is perfectly made, beautifully polished, completely smooth, spotless, without dents or smudges, perfectly clean, free of dust and grease, made as an object with many uses, of the highest quality, replete with the five points, free of the ten points, and devoid of the twelve faults.

source: ལུགས་ལན་སྟོང་དུ་བརྟགས་ཤིང་གསེར་དངུལ་གྱི་སྐྱོན་དང་བྲལ་བ། ཤིན་ཏུ་དག་པ། འབྱུང་ཁུངས་བཟང་པོ་ནས་བྱུང་བ། རིགས་དང་ལྡན་པ།
en: Its physical form examined a thousand times, its gold and silver are faultless, very pure, and from a good source.

source: གསེར་གྱི་རིགས་ཁྱད་པར་ཅན་བརྒྱ་ལས་བྱས་པ། མ་ཞོམ་པ།
en: Very fine, it was fashioned with a hundred types of special gold.

source: ཡན་ལག་བརྒྱད་ལ་མཁས་པའི་མི་སྟོང་གིས་ལེགས་པར་བསྲེགས་པ།
en: Straight and solid, it was skillfully smelted by a thousand craftsmen expert in the eight qualities.

source: ཉེ་བའི་སྐྱོན་ཐམས་ཅད་དང་བྲལ་བ་ལས་ནི་སྡུག་བསྔལ་ཐམས་ཅད་ཉེ་བར་ཞི་བར་བྱེད་པའི་སྒྲ་འབྱུང་ངོ་། །
en: Free of all defects, its sound is such that it could quell any suffering.

source: ཀུན་དགའ་བོ་དེ་འདྲ་བའི་དེ་ལྟ་བུ་དེ་ལྟར་སྣང་བའི་ནི་དཔེར་བྱ་བ་ཙམ་དང་། ཉེ་བར་མཚོན་པ་ཙམ་དུ་ཟད་དེ། དེ་བཞིན་དུ་ཁྱེའུ་འདིས་རིན་པོ་ཆེ་སྣ་ཚོགས་ལས་བྱས་པའི་དབྱིག་པས་ས་ཆེན་པོ་འདི་ལ་རྡེབས་པ་ན་ཡང་དེ་ལྟ་བུའི་སྒྲ་འབྱུང་ངོ་། །
en: Ānanda, these are mere examples, mere illustrations, to show what the sound was like when the child struck the earth with his staff made from various precious substances.

source: ཀུན་དགའ་བོ་ཁྱེའུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་ཞི་བར་གནས་ཞེས་བྱ་བ་ཡིན་ཏེ་ལྷོ་ཕྱོགས་ལོགས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བལྟ་མཛེས་རིན་ཆེན་བརྩེགས་ཞེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱ་བ་ནས་འོངས་པ་ཡིན་ནོ། །
en: “Ānanda, this child called Thoroughly at Peace is a bodhisattva great being who has come from the south, from the world called Ratnavyūha in the buddha field of the thus-gone, worthy, perfect buddha called Beautiful Heap of Jewels.

source: ཀུན་དགའ་བོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Ānanda, what do you think?

source: ཅིའི་ཕྱིར་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱ་ཞེ་ན།
en: Why is that world called Ratnavyūha?

source: ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ལོག་པ་ཉིད་དུ་ངེས་པ་དང་མ་ངེས་པའི་སེམས་ཅན་གྱི་མིང་ཡང་མེད་དེ།
en: Ānanda, in that world there is no mention of beings being mistaken or being correct.

source: ཀུན་དགའ་བོ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་འཇིག་པ་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པ་ཤ་སྟག་ཡིན་ནོ། །
en: Ānanda, every being there is fearless and sure to reach completely perfect awakening.

source: ཀུན་དགའ་བོ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཞིང་ཁོ་ན་ཡིན་ཏེ། དེ་ན་སྐྱེས་པ་དང་བུད་མེད་ཀྱི་མིང་ཡང་མེད་དོ། །
en: Ānanda, that buddha field is a realm of bodhisattvas only, where there is no mention of being a man or a woman.

source: ཀུན་དགའ་བོ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་ཚངས་པར་སྤྱོད་པ་དང་། གཙང་བ་དང་། དྲི་ང་བ་མེད་པ་དང་། ཤེས་པའི་སྤྱོད་ཡུལ་གཙང་བ་དང་། འཁྲིག་པ་དང་བྲལ་བ་ཡིན་ཏེ།
en: Ānanda, all beings there are celibate, clean, without bad odor, and pure in thought.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་འཁྲིག་པའི་ཆོས་ཀྱི་མིང་ཡང་མེད་དོ། །
en: They do not engage in sexual intercourse; indeed there is no concept of sex in that world.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་དེ་དག་ལ་མི་དགེ་བའི་རྣམ་པར་རྟོག་པ་དག་ཀུན་ཏུ་འབྱུང་བ་མེད་ཅིང་། ཟས་རྣམ་གཉིས་མ་གཏོགས་པར་ཟས་ཀྱི་འདུ་ཤེས་ཀྱང་མེད་དོ། །
en: “No nonvirtuous thoughts occur to beings in that buddha field, and there is no notion of food apart from the two types of sustenance.

source: ཡེ་ཤེས་ཀྱིས་སྙོམས་པར་འཇུག་པའི་ཟས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡང་དག་པར་བརྗོད་པའི་ཟས་སོ། །
en: The sustenance of meditative equipoise achieved through wisdom, and the sustenance that comes through perfectly explaining the Buddha’s Dharma.

source: ཀུན་དགའ་བོ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཕུང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ལ་རྒྱ་ཆེར་འཇུག་པ་མ་གཏོགས་པར་ཕུང་པོ་གཉིས་དང་ཐེག་པ་གསུམ་སྟོན་པ་མེད་དེ།
en: Ānanda, in that buddha field there are no teachings of the two categories and the three vehicles, only the body of teachings on omniscient wisdom and the vast discourses of the Bodhisattva Collection.

source: ཀུན་དགའ་བོ་རྣམ་གྲངས་དེས་ན་འཇིག་རྟེན་གྱི་ཁམས་དེ་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོའོ། །ཀུན་དགའ་བོ་སེམས་ཅན་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེས་པ་དང་། གང་དག་འཇིག་རྟེན་གྱི་ཁམས་དེར་སྐྱེ་བར་སེམས་སྐྱེད་པར་བྱེད་པ་དེ་དག་ཐམས་ཅད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Ānanda, it is because of those discourses that this realm is called Ratnavyūha.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ནི་སྐྱེས་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་མངོན་པར་ཤེས་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སྐད་ཅིག་དེ་དང་། ཐང་ཅིག་དེ་དང་།
en: “Ānanda, those bodhisattvas from other worlds who are reborn in that buddha field will, immediately upon taking birth there, have clairvoyance of all the buddha fields.

source: ཡུད་ཙམ་དེ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སངས་རྒྱས་འབྱུང་བའི་འདུ་ཤེས་ཅན་དུ་འགྱུར་རོ། །
en: In that very moment, right then, at that instant, they will also perceive the buddha who appears in that buddha field.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་བལྟ་མཛེས་རིན་ཆེན་བརྩེགས་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ཚད་མེད་པ་དེ་དག་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པ་ཁོ་ནའི་གཏམ་མ་འདྲེས་པ་དག་སྟོན་པར་མཛད་དེ། འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: “Ānanda, the Thus-Gone Beautiful Heap of Jewels teaches those countless billions of bodhisattvas with omniscience and without narrative digression, that is to say, he perfectly teaches them the vast corpus of the Bodhisattva Collection.

source: ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་དེའི་བསྔགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རེ་རེའི་ཆོས་ཀྱི་ཁྱད་པར་འདི་ལྟ་སྟེ། སྨོན་ལམ་བརྩམས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་དག་ངས་བརྗོད་པར་གྱུར་ན་བསྐལ་པ་སྟོང་ཕྲག་མང་པོས་ཀྱང་མཐར་ཐུག་པར་མི་འགྱུར་ཏེ།
en: “Ānanda, if I were to describe the special qualities of each bodhisattva great being there in that world and the praises suitable to each, the aspiration prayer composed for that buddha field would not be complete even after a thousand eons.

source: ཀུན་དགའ་བོ་ངས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་ཞི་བར་གནས་པ་འདི་གང་ནས་འོངས་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེའི་མིང་ཙམ་ཞིག་བརྗོད་པར་ཟད་དོ། །
en: So, Ānanda, I can do no more than speak the name of that realm from which the bodhisattva great being Thoroughly at Peace has come.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་ཞི་བར་གནས་པ་འདི་ནི་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ལ་བལྟ་བ་དང་། སེམས་ཅན་མང་པོ་རྣམས་སྐྱོ་བ་བསྐྱེད་པར་བྱ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་དེའི་མིང་དང་ཡོན་ཏན་ཡོངས་སུ་བསྒྲག་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དེའི་བསྔགས་པ་རབ་ཏུ་བཤད་པར་བྱ་བ་དང་།
en: “Ānanda, the bodhisattva great being Thoroughly at Peace has come here to see me pass into parinirvāṇa, to instill disenchantment in many beings, to make the name and the qualities of that world well known, and to sing the praises of that thus-gone one.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་སྐྱེས་བུ་དམ་པ་རྣམས་ཀྱི་ཆོས་ཀྱི་བདག་ཉིད་ཆེན་པོ་དང་། ཡང་དག་པའི་ཡོན་ཏན་ཡོངས་སུ་བསྒྲག་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་སེམས་ཅན་ཚད་མེད་པ་རྣམས་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་བྱ་བ་དང་། མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱ་བ་དང་། ཡང་དག་པར་དད་པ་བསྐྱེད་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་འོངས་སོ། །
en: He has come to this buddha field to proclaim the greatness and the pure qualities of those exceptional beings who follow the bodhisattva vehicle, so that countless beings in this buddha field will uphold the sublime Dharma, so that bodhisattvas in the future will be thoroughly happy, and to instill complete faith.

source: ཀུན་དགའ་བོ་སྔོན་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་འཇིག་རྟེན་དུ་བྱུང་བ་ན་ཁྱེའུ་འདི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཞེས་བྱ་བར་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། །
en: “Ānanda, in the past, when the thus-gone Dīpaṅkara appeared in the world, this child was born as the universal monarch named Ajātaśatru, and he trained in the practice of a bodhisattva.

source: ཀུན་དགའ་བོ་དེའི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དེ་སྲོག་ཆགས་བྱེ་བ་ཕྲག་མང་པོ་དག་ལ་ཆོས་སྟོན་ཅིང་དགེ་བའི་རྩ་བ་དག་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ།
en: Ānanda, at that time, the universal monarch Ajātaśatru taught the Dharma to many millions of beings, causing their roots of virtue to mature.

source: དེས་ཉི་མ་འཆར་ཀ་ཙམ་གྱི་སྔ་དྲོ་གཅིག་གིས་ཀྱང་སྲོག་ཆགས་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཀོད་ཅིང་སྐྱོན་མེད་པར་ཞུགས་ཏེ། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་ལྡན་པར་བྱས་སོ། །
en: In a single morning, even before the sun rose, he had established three hundred sixty million beings at the level of irreversibility on the path to unsurpassed, completely perfect awakening, so that they were faultless and reached acceptance of the unborn nature of phenomena.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དེ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། །
en: After the thus-gone, worthy, perfect Buddha Dīpaṅkara’s parinirvāṇa, the faithful Ajātaśatru renounced his home and went forth to live a life of homelessness.

source: དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་ཀྱང་ལོ་སྟོང་ཐམ་པར་བཅོམ་ལྡན་འདས་མར་མེ་མཛད་དེའི་རྗེས་སུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏོ། །
en: For a full thousand years after he went forth as a renunciate, he turned the wheel of the Dharma in accordance with the Blessed Dīpaṅkara’s teachings.

source: དེས་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ནས་ཉི་མ་ཐ་མའི་ཉི་མ་ནུབ་ཀར་ཡང་སྲོག་ཆགས་བྱེ་བ་ཕྲག་དྲུག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་ཏེ།
en: He benefited countless beings. On the final day, as the sun was setting, he ripened sixty million beings in the state of unsurpassed, completely perfect awakening.

source: དེ་ཉིད་ཀྱི་ཉི་མ་ནུབ་ཀར་སྲོག་ཆགས་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུ་ཟག་པ་ཟད་པ་ལ་ཡང་རབ་ཏུ་བཀོད་པར་གྱུར་ན། སློབ་པ་རྣམས་ཀྱི་མཐོང་བའི་སའམ་བསྒོམ་པའི་ས་ལ་བཀོད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: When the sun set that day, seventy billion beings had reached the level of the exhaustion of defilements, not to mention those disciples established at the level of seeing and the level of cultivation.

source: ཀུན་དགའ་བོ་ངས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་ཞི་བར་གནས་ཀྱི་བསྔགས་པ་མང་པོ་དང་། ཁྱེའུ་འདིས་སེམས་ཅན་ཇི་སྙེད་ཅིག་གི་དོན་བྱས་པ་དག་བརྗོད་པར་གྱུར་ན། བསྐལ་པ་སྟོང་ཕྲག་མང་པོས་ཀྱང་མཐར་ཐུག་པར་མི་འགྱུར་རོ། །
en: “Ānanda, if, with awakened wisdom, I were to speak of the many praises of the bodhisattva great being Thoroughly at Peace and the benefits this child has brought to each and every being, I would not reach the end even after many thousands of eons.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ངའི་སྤྱན་སྔར་རིགས་ཀྱི་བུ་རབ་ཏུ་ཞི་བར་གནས་ཀྱི་སྟན་ཐིང་ཤིག་དང་། ཁྱོད་ལ་བསོད་ནམས་མང་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: “Ānanda, arrange before me a seat for the noble son Thoroughly at Peace, and it will bring you great merit, Ānanda.

source: ཀུན་དགའ་བོ་སེམས་ཅན་གང་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་ཞི་བར་གནས་ཀྱི་མིང་ཐོས་པ་དེ་དག་ལ་ནི་མངོན་སུམ་དུ་སངས་རྒྱས་བྱུང་བ་ཡིན་ནོ། །
en: To those who hear the name of the bodhisattva great being Thoroughly at Peace, he is a buddha.

source: ཀུན་དགའ་བོ་གང་སུ་དག་ཡོན་ཏན་བཀོད་པ་ལུང་སྟོན་པ་རྒྱ་ཆེར་བསྟན་པའི་ཆོས་འདི་བཤད་པ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བལྟ་མཛེས་རིན་ཆེན་བརྩེགས་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་བསྙེན་བཀུར་བྱ་བ་དང་། དམ་པའི་ཆོས་མཉན་པའི་ཕྱིར་དད་པའི་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་ཐོབ་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་ཀུན་དགའ་བོ་ཆོས་ཐུན་མོང་ཡིན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་དེ་ལ་བལྟ་བ་དང་། དམ་པའི་ཆོས་ཉན་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དེའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་བལྟ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་ངས་ལུང་བསྟན་པ་ཡིན་ཏེ།
en: “Ānanda, I prophesy that, aside from those with the particular aspirations of bodhisattva great beings, anyone who upon receiving this extensive and authoritative Dharma instruction that is rich in qualities develops even for an instant the faithful intention to look upon and venerate and serve the blessed, thus-gone, worthy, perfect Buddha Beautiful Heap of Jewels and listen to his sublime Dharma will, because, Ānanda, this is a common teaching, certainly be reborn in that buddha field and look upon that blessed one and listen to his sublime Dharma and see the bodhisattva great beings of that buddha field.

source: ཀུན་དགའ་བོ་སེམས་ཅན་གང་དག་གི་རྣ་བའི་དབང་པོས་ཡོན་ཏན་བཀོད་པ་ལུང་སྟོན་པ་རྒྱ་ཆེར་བསྟན་པའི་ཆོས་བཤད་པ་འདི་ཉིད་ཐོས་པར་གྱུར་པ་དེ་དག་ཀྱང་རྙེད་པ་ལེགས་པར་རྙེད་ཅིང་ཤིན་ཏུ་ལེགས་པར་རྙེད་པ་ཡིན་ན།
en: Ānanda, those beings who have directly heard with their faculty of hearing this extensive and authoritative Dharma instruction that is rich in qualities will be very fortunate; they will be immensely fortunate.

source: གང་གིས་འདི་ཐོས་ནས་དད་པ་སྐྱེད་པར་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: It goes without saying that anyone who has heard it will have faith.

source: ཀུན་དགའ་བོ་གནས་འདི་ལྟ་བུ་དེ་དག་དང་། ཆོས་ཀྱི་ཚིག་གི་གནས་འདི་ལྟ་བུ་དེ་དག་ལེགས་པར་བསྲུང་བར་བྱ་ཞིང་ལེགས་པར་ཡིད་ལ་བྱའོ། །
en: “So, Ānanda, occasions such as these, occasions for Dharma teachings such as this, must be guarded well and remembered faithfully.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: ཀུན་དགའ་བོ་མདོ་སྡེ་འདི་ལྟ་བུ་དག་ནི་འཛམ་བུའི་གླིང་གི་མི་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་བརྙན་སྟོན་པ་རྣམས་དང་། དམ་པའི་ཆོས་སྤོང་བར་བྱེད་པ་རྣམས་ཀྱིས་སྔོན་མ་ཐོས་པའི་ཕྱིར་ཏེ། ཁྱོད་ཀྱིས་ཆོས་སྤོང་བར་བྱེད་པ་དག་ནི་མིག་ལམ་དུ་ཡང་མི་སྣང་བར་བྱའོ། །
en: Because, Ānanda, discourses like this have never before been heard by the people of Jambudvīpa, nor by those displaying the form of bodhisattvas, nor by those who renounce the sublime Dharma, though you should not set eyes on those who renounce the Dharma.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་འདི་ནས་ནུབ་ཕྱོགས་ཀྱི་ངོས་ཀྱི་ནམ་མཁའ་ལས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པ་བརྩེགས་པ་ཞིག་འོང་བ་འདི་མཐོང་ངམ། གསོལ་པ།
en: “Ānanda, did you see the storied mansion of various precious substances that arrived in the sky from the west?”

source: བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །བཀའ་སྩལ་པ།
en: “Yes indeed, Blessed One.”

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ནུབ་ཕྱོགས་ནས་ཁྱེའུ་ཞིག་སེམས་ཅན་གདུལ་བར་བྱ་བའི་ཕྱིར་རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་རྩེ་ཞིང་གློ་གཉིས་ཀྱིས་ས་ཆེན་པོ་འདི་འགུལ་བར་བྱེད། རབ་ཏུ་འགུལ་བར་བྱེད། གཡོ་བར་བྱེད། རབ་ཏུ་གཡོ་བར་བྱེད། ལྡེག་པར་བྱེད། རབ་ཏུ་ལྡེག་པར་བྱེད་ཅིང་ས་ཆེན་པོ་གཡོ་བས་འཇིགས་སུ་རུང་བ་དང་། སྤུ་ཟིང་ཞེས་བྱེད་པ་ཀུན་ཏུ་སྟོན་པར་བྱེད་ཅིང་འོང་བ་མཐོང་ངམ།
en: “Ānanda, did you see the child coming here from the west to tame beings, reveling in his magical power, making this great earth shake on both sides, making it shake a lot, making it tremble and tremble a lot, and making it shudder and shudder a lot—making the earth quake so terrifyingly that everyone’s hair stood on end in alarm?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །
en: “Yes indeed, Blessed One.

source: བདེ་བར་གཤེགས་པ་དེ་དེ་ལྟ་ལགས་ཏེ།
en: Yes indeed, Well-Gone One.

source: བཅོམ་ལྡན་འདས་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་བགྱིད་ཅིང་མཆི་བའི་ཁྱེའུ་འདི་མཐོང་ལགས་སོ། །བཀའ་སྩལ་པ།
en: Blessed One, I saw the child arriving, displaying his magical power.”

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུ་འདིའི་མདུན་ནས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པ་བརྩེགས་པ་འོང་བ་གང་ཡིན་པ་འདིས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་དྲི་སྣ་ཚོགས་ཀྱིས་ཀུན་ཏུ་གང་བར་གྱུར་ཏོ། །གསོལ་པ།
en: “Ānanda, was it in front of this noble son that the storied mansion of various precious substances arrived, spreading all kinds of scents from his buddha realm everywhere?”

source: ཀུན་དགའ་བོ་དེ་ནི་རིགས་ཀྱི་བུ་འདིའི་ཡེ་ཤེས་ཀྱི་སྟོབས་བསྐྱེད་པ་ཡིན་ཏེ། དེས་ན་ཁང་པ་བརྩེགས་པ་འདི་ལས་དེ་ལྟ་བུའི་དྲི་འབྱུང་ངོ་། །
en: “Ānanda, it was by the power of this noble son’s wisdom that those scents wafted from the precious storied mansion.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་སྒྲ་བཞི་པོ་འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་ཅེས་བྱ་བ་དང་། དངོས་པོ་མེད་པ་ཞེས་བྱ་བ་དང་། ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཞེས་བྱ་བ་འབྱུང་བ་འདི་དག་ཐོས་སམ།
en: Did you hear, Ānanda, the four sounds coming from it: the sounds ‘emptiness,’ ‘unreal,’ ‘peace,’ and ‘awakened’?”

source: བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ས་འདི་དག་ནི་ཁྱེའུ་འདིའི་སྤུའི་ཁུང་བུ་དག་ནས་འབྱུང་སྟེ།
en: “Ānanda, these sounds come from the pores of this child.

source: ཀུན་དགའ་བོ་ས་འདི་དག་ཐོས་པས་སྲོག་ཆགས་ཁྲག་ཁྲིག་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ཀྱི་དོན་བྱས་སོ། །སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་མང་པོ་རྣམས་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: Ānanda, these sounds have brought benefit to the sixty-eight billion beings who heard them.

source: ཀུན་དགའ་བོ་སངས་རྒྱས་ཀྱི་སྒྲ་གཅིག་པུ་ཐོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་ངེས་པར་ཞུགས་སོ། །གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་ལྷ་དང་མིར་བཅས་པའི་སྐྱེ་དགུ་དག་ལས་ལྷ་དང་། མི་ཁྲག་ཁྲིག་འབུམ་ཕྲག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པ་ལས་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་གནས་པར་གྱུར་ཏོ། །
en: The minds of many beings of the chiliocosm have been liberated from defilements with no more grasping, and, Ānanda, ten million bodhisattvas, hearing the sound ‘awakened’ alone, entered with certainty the level of irreversibility on the path to unsurpassed, completely perfect awakening, and among the beings of this buddha field, too, with its gods and humans, a hundred thousand billion gods and humans were settled with certainty at the level of irreversibility on the path to unsurpassed, completely perfect awakening.

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་བལྟ་བའི་ཕྱིར་ནུབ་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགའ་བའི་དབང་ཕྱུག་ཅེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་དགའ་སྤུ་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་འོངས་པ་ཡིན་ཏེ།
en: “Ānanda, in order to see me, the Thus-Gone One, passing into nirvāṇa, this noble son has come to this buddha field from the west, from the world called Joy in the buddha field of the thus-gone, worthy, perfect buddha Lord of Joy.

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུ་འདི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་འོངས་མ་ཐག་ཏུ་འདིས་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཏེ། སངས་རྒྱས་ཀྱི་མཛད་པ་བྱས་ཤིང་འདིས་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་རྗེས་སུ་བསྐོར་ཏོ། །
en: Ānanda, since this noble son arrived here in this buddha field, he has benefited countless beings, he has performed awakened activities, and he has turned the wheel of Dharma.

source: ཀུན་དགའ་བོ་བསྐལ་པ་གྲངས་མེད་པ་ཚུན་ཆད་ནས་རིགས་ཀྱི་བུ་འདིའི་སྤུའི་ཁུང་བུ་དག་ནས་སྒྲ་བཞི་པོ་འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་སྒྲ་དང་། དངོས་པོ་མེད་པའི་སྒྲ་དང་། ཉེ་བར་ཞི་བའི་སྒྲ་དང་། སངས་རྒྱས་ཀྱི་སྒྲ་འདི་དག་འབྱུང་སྟེ།
en: Ānanda, over the span of countless eons up to now, sounds have been emerging from the pores of this noble son: the word ‘emptiness,’ the word ‘unreal,’ the word ‘peace,’ and the word ‘awakened.’

source: སྒྲ་རེ་རེས་ཀྱང་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་སོ། །ཀུན་དགའ་བོས་གསོལ་པ།
en: Each of these sounds has brought benefit to countless beings.”

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འདིས་དགེ་བའི་རྩ་བ་ཅི་ཞིག་བསགས་ལགས་ན་དེས་ད་ལྟར་འདིའི་སྤུའི་ཁུང་བུ་དག་ནས་འདི་ལྟ་བུའི་སྒྲ་དག་འབྱུང་བར་འགྱུར་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མེད་སྤྱན་ཞེས་བྱ་བ། རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: Ānanda then asked, “Blessed One, what roots of virtue did this noble son gather so that such sounds would emerge from his pores in this way?”

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: The Blessed One replied, “Ānanda, in a former time, a thus-gone, worthy, perfect buddha named Flawless Eye—a blessed buddha, perfect in wisdom and conduct, a well-gone one, a knower of the world, a guide who tames beings, an unsurpassed teacher of gods and humans—appeared in the world.

source: རིགས་ཀྱི་བུ་འདི་དེའི་གསུང་རབ་ལ་དགེ་སློང་ཡེ་ཤེས་དགའ་བ་ཞེས་བྱ་བར་གྱུར་ནས་དེས་དེ་བཞིན་གཤེགས་པ་དེའི་སྤྱན་སྔ་ནས་ཡེ་ཤེས་ཀྱི་ཚིག་དང་། རྟོགས་པར་དཀའ་བའི་ཚིག་དང་།
en: This noble son attended his discourses as a monk called Delighting in Wisdom.
